{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"id":"Yl9npCt8n6m-","executionInfo":{"status":"ok","timestamp":1601636515184,"user_tz":-120,"elapsed":5382,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"7e4e2f2b-0d70-47ca-a1ab-29e0d5d84b52","colab":{"base_uri":"https://localhost:8080/","height":207}},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2020-2021/master/Assignment4\""],"execution_count":2,"outputs":[{"output_type":"stream","text":["Collecting rdflib\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/d0/6b/6454aa1db753c0f8bc265a5bd5c10b5721a4bb24160fb4faf758cf6be8a1/rdflib-5.0.0-py3-none-any.whl (231kB)\n","\u001b[K     |████████████████████████████████| 235kB 2.7MB/s \n","\u001b[?25hRequirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib) (1.15.0)\n","Collecting isodate\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9b/9f/b36f7774ff5ea8e428fdcfc4bb332c39ee5b9362ddd3d40d9516a55221b2/isodate-0.6.0-py2.py3-none-any.whl (45kB)\n","\u001b[K     |████████████████████████████████| 51kB 3.5MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib) (2.4.7)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.0 rdflib-5.0.0\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Read the RDF file"]},{"cell_type":"code","metadata":{"id":"9ERh415on7kF","executionInfo":{"status":"ok","timestamp":1601636518508,"user_tz":-120,"elapsed":2061,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"92b43a70-daae-431a-af19-95df8906791f","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":3,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=Nb6a2b5b6b3ec485a82db76f2940de4b3 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{"tags":[]},"execution_count":3}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"YAfpOaE4fRXw","executionInfo":{"status":"ok","timestamp":1601636523000,"user_tz":-120,"elapsed":1804,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"3930d7aa-f388-4144-eaa1-9b6436b37102","colab":{"base_uri":"https://localhost:8080/","height":51}},"source":["#RDFLib\n","ns=Namespace (\"http://somewhere#\")\n","for s, p, o in g.triples((None,RDFS.subClassOf,ns.Person)):\n","    print (\"SUBCLASSES\\n\",s)"],"execution_count":4,"outputs":[{"output_type":"stream","text":["SUBCLASSES\n"," http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"s_OOSy3Narze","executionInfo":{"status":"ok","timestamp":1601636527813,"user_tz":-120,"elapsed":2920,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"64269261-8975-4047-a692-f0947a66d0bc","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["#RDFLib + SPARQL\n","from rdflib.plugins.sparql import prepareQuery\n","\n","q1 = prepareQuery ('''\n","  SELECT ?s WHERE { ?s rdfs:subClassOf ns:Person. }\n","''',\n","initNs = { \"ns\": ns})\n","for a in g.query(q1):\n","  print (a.s)"],"execution_count":5,"outputs":[{"output_type":"stream","text":["http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"id":"z_9JnrZPhOBp","executionInfo":{"status":"ok","timestamp":1601636533036,"user_tz":-120,"elapsed":1841,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"43264acb-7ff3-4f99-a97b-c9f9b8b2987f","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib\n","for s, p, o in g.triples((None,RDF.type,ns.Person)):\n","  print (s)\n","print (g.value(subject=None,predicate=RDF.type,object=\n","       g.value(subject=None,predicate=RDFS.subClassOf,object=ns.Person))\n","      )"],"execution_count":6,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith\n","http://somewhere#SaraJones\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"k1vTxqpbfWg1","executionInfo":{"status":"ok","timestamp":1601636535988,"user_tz":-120,"elapsed":1627,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"6d370fa1-ab09-43b9-a823-7aa394462ee2","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib+SPARQL\n","q2=prepareQuery('''\n","  SELECT ?s WHERE {?s a/rdfs:subClassOf* ns:Person.}\n","  ''',\n","  initNs = {\"ns\":ns } )\n","\n","for a in g.query(q2):\n","  print (a.s)"],"execution_count":7,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith\n","http://somewhere#SaraJones\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"id":"kyAfdnhXjJaC","executionInfo":{"status":"ok","timestamp":1601636539853,"user_tz":-120,"elapsed":1681,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"cf70577e-9da1-48f2-bfce-2b32c0fe3b4e","colab":{"base_uri":"https://localhost:8080/","height":221}},"source":["#RDFLib\n","for s, p, o in g.triples((None,RDF.type,ns.Person)):\n","  for s1,p1,o1 in g.triples((s,None,None)):\n","    print(s1,p1,o1)\n","for s,p,o in g.triples((None,RDF.type,g.value(subject=None,predicate=RDFS.subClassOf,object=ns.Person))):\n","  for s2,p2,o2 in g.triples((s,None,None)):\n","    print(s2,p2,o2)"],"execution_count":8,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"WacnGUj2jaO9","executionInfo":{"status":"ok","timestamp":1601636542975,"user_tz":-120,"elapsed":1635,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"ba4fb6d6-e332-4bd1-b828-d671b819e507","colab":{"base_uri":"https://localhost:8080/","height":221}},"source":["#RDFLib + SPARQL\n","q3=prepareQuery('''\n","  SELECT ?s ?p ?o WHERE {?s a/rdfs:subClassOf* ns:Person. \n","                      ?s ?p ?o}\n","  ''',\n","  initNs = { \"ns\": ns} )\n","\n","for a in g.query(q3):\n","  print(a.s, a.p, a.o)"],"execution_count":9,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]}]}