{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"id":"Yl9npCt8n6m-","executionInfo":{"status":"ok","timestamp":1601626992179,"user_tz":-120,"elapsed":6226,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"b5f06788-e3d6-4d6b-d756-258c591f50a9","colab":{"base_uri":"https://localhost:8080/","height":207}},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2020-2021/master/Assignment4\""],"execution_count":2,"outputs":[{"output_type":"stream","text":["Collecting rdflib\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/d0/6b/6454aa1db753c0f8bc265a5bd5c10b5721a4bb24160fb4faf758cf6be8a1/rdflib-5.0.0-py3-none-any.whl (231kB)\n","\r\u001b[K     |█▍                              | 10kB 16.3MB/s eta 0:00:01\r\u001b[K     |██▉                             | 20kB 1.7MB/s eta 0:00:01\r\u001b[K     |████▎                           | 30kB 2.2MB/s eta 0:00:01\r\u001b[K     |█████▊                          | 40kB 2.5MB/s eta 0:00:01\r\u001b[K     |███████                         | 51kB 2.0MB/s eta 0:00:01\r\u001b[K     |████████▌                       | 61kB 2.2MB/s eta 0:00:01\r\u001b[K     |██████████                      | 71kB 2.5MB/s eta 0:00:01\r\u001b[K     |███████████▍                    | 81kB 2.6MB/s eta 0:00:01\r\u001b[K     |████████████▊                   | 92kB 2.9MB/s eta 0:00:01\r\u001b[K     |██████████████▏                 | 102kB 2.8MB/s eta 0:00:01\r\u001b[K     |███████████████▋                | 112kB 2.8MB/s eta 0:00:01\r\u001b[K     |█████████████████               | 122kB 2.8MB/s eta 0:00:01\r\u001b[K     |██████████████████▍             | 133kB 2.8MB/s eta 0:00:01\r\u001b[K     |███████████████████▉            | 143kB 2.8MB/s eta 0:00:01\r\u001b[K     |█████████████████████▎          | 153kB 2.8MB/s eta 0:00:01\r\u001b[K     |██████████████████████▊         | 163kB 2.8MB/s eta 0:00:01\r\u001b[K     |████████████████████████        | 174kB 2.8MB/s eta 0:00:01\r\u001b[K     |█████████████████████████▌      | 184kB 2.8MB/s eta 0:00:01\r\u001b[K     |███████████████████████████     | 194kB 2.8MB/s eta 0:00:01\r\u001b[K     |████████████████████████████▍   | 204kB 2.8MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▉  | 215kB 2.8MB/s eta 0:00:01\r\u001b[K     |███████████████████████████████▏| 225kB 2.8MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 235kB 2.8MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib) (2.4.7)\n","Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib) (1.15.0)\n","Collecting isodate\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9b/9f/b36f7774ff5ea8e428fdcfc4bb332c39ee5b9362ddd3d40d9516a55221b2/isodate-0.6.0-py2.py3-none-any.whl (45kB)\n","\u001b[K     |████████████████████████████████| 51kB 4.8MB/s \n","\u001b[?25hInstalling collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.0 rdflib-5.0.0\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Read the RDF file"]},{"cell_type":"code","metadata":{"id":"9ERh415on7kF","executionInfo":{"status":"ok","timestamp":1601627088143,"user_tz":-120,"elapsed":1317,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"35c076d5-8818-4636-82ee-f7ee91a791c3","colab":{"base_uri":"https://localhost:8080/","height":54}},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":3,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N1abf22e70a574354be64593c88b2620f (<class 'rdflib.graph.Graph'>)>"]},"metadata":{"tags":[]},"execution_count":3}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"YAfpOaE4fRXw","executionInfo":{"status":"ok","timestamp":1601628111088,"user_tz":-120,"elapsed":568,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"9ec99235-65cf-4f8a-cea8-c2a5ea680652","colab":{"base_uri":"https://localhost:8080/","height":51}},"source":["#RDFLib\n","ns=Namespace (\"http://somewhere#\")\n","for s, p, o in g.triples((None,RDFS.subClassOf,ns.Person)):\n","    print (\"SUBCLASSES\\n\",s)"],"execution_count":19,"outputs":[{"output_type":"stream","text":["SUBCLASSES\n"," http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"s_OOSy3Narze","executionInfo":{"status":"ok","timestamp":1601630181745,"user_tz":-120,"elapsed":550,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"b1ca4fb7-139d-4ecf-e5f2-a7e83f147354","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["#RDFLib + SPARQL\n","from rdflib.plugins.sparql import prepareQuery\n","\n","q1 = prepareQuery ('''\n","  SELECT ?s WHERE { ?s rdfs:subClassOf ns:Person. }\n","''',\n","initNs = { \"ns\": ns})\n","for a in g.query(q1):\n","  print (a.s)"],"execution_count":71,"outputs":[{"output_type":"stream","text":["http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"id":"z_9JnrZPhOBp","executionInfo":{"status":"ok","timestamp":1601628360748,"user_tz":-120,"elapsed":632,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"338a449e-26c4-48fb-e5b5-df4a97ae4a7b","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib\n","for s, p, o in g.triples((None,RDF.type,ns.Person)):\n","  print (s)\n","print (g.value(subject=None,predicate=RDF.type,object=\n","       g.value(subject=None,predicate=RDFS.subClassOf,object=ns.Person))\n","      )"],"execution_count":27,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith\n","http://somewhere#SaraJones\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"k1vTxqpbfWg1","executionInfo":{"status":"ok","timestamp":1601630173495,"user_tz":-120,"elapsed":609,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"598ad4e7-d060-4051-9914-3953f59304f9","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib+SPARQL\n","q2=prepareQuery('''\n","  SELECT ?s WHERE {?s a/rdfs:subClassOf* ns:Person.}\n","  ''',\n","  initNs = {\"ns\":ns } )\n","\n","for a in g.query(q2):\n","  print (a.s)"],"execution_count":70,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith\n","http://somewhere#SaraJones\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"id":"kyAfdnhXjJaC","executionInfo":{"status":"ok","timestamp":1601629401770,"user_tz":-120,"elapsed":1108,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"0b56a5d2-a6d0-4374-8549-1a4dcbfdb734","colab":{"base_uri":"https://localhost:8080/","height":241}},"source":["#RDFLib\n","for s, p, o in g.triples((None,RDF.type,ns.Person)):\n","  for s1,p1,o1 in g.triples((s,None,None)):\n","    print(s1,p1,o1)\n","for s,p,o in g.triples((None,RDF.type,g.value(subject=None,predicate=RDFS.subClassOf,object=ns.Person))):\n","  for s2,p2,o2 in g.triples((s,None,None)):\n","    print(s2,p2,o2)"],"execution_count":40,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"WacnGUj2jaO9","executionInfo":{"status":"ok","timestamp":1601630156510,"user_tz":-120,"elapsed":514,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"1ca402ed-ed0b-4d05-bfe4-7afa66eb6d8f","colab":{"base_uri":"https://localhost:8080/","height":241}},"source":["#RDFLib + SPARQL\n","q3=prepareQuery('''\n","  SELECT ?s ?p ?o WHERE {?s a/rdfs:subClassOf* ns:Person. \n","                      ?s ?p ?o}\n","  ''',\n","  initNs = { \"ns\": ns} )\n","\n","for a in g.query(q3):\n","  print(a.s, a.p, a.o)"],"execution_count":69,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]}]}
