{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"id":"Yl9npCt8n6m-","executionInfo":{"status":"ok","timestamp":1601717791949,"user_tz":-120,"elapsed":5642,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"2d8a9cfb-2c3e-46e4-d567-c991ac419fda","colab":{"base_uri":"https://localhost:8080/","height":207}},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2020-2021/master/Assignment4\""],"execution_count":1,"outputs":[{"output_type":"stream","text":["Collecting rdflib\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/d0/6b/6454aa1db753c0f8bc265a5bd5c10b5721a4bb24160fb4faf758cf6be8a1/rdflib-5.0.0-py3-none-any.whl (231kB)\n","\u001b[K     |████████████████████████████████| 235kB 3.4MB/s \n","\u001b[?25hCollecting isodate\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9b/9f/b36f7774ff5ea8e428fdcfc4bb332c39ee5b9362ddd3d40d9516a55221b2/isodate-0.6.0-py2.py3-none-any.whl (45kB)\n","\u001b[K     |████████████████████████████████| 51kB 5.1MB/s \n","\u001b[?25hRequirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib) (1.15.0)\n","Requirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib) (2.4.7)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.0 rdflib-5.0.0\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Read the RDF file"]},{"cell_type":"code","metadata":{"id":"9ERh415on7kF","executionInfo":{"status":"ok","timestamp":1601717907392,"user_tz":-120,"elapsed":1176,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"00c03ec5-ceb9-4239-bdb0-0e9dbfb59e54","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":3,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N1860e72c829e4b309ddf020245bbf480 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{"tags":[]},"execution_count":3}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"YAfpOaE4fRXw","executionInfo":{"status":"ok","timestamp":1601717989142,"user_tz":-120,"elapsed":559,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"7f3bf832-bc1c-42ca-f07b-d0991c3fdfad","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib\n","ns=Namespace (\"http://somewhere#\")\n","print(\"SUBCLASSES\")\n","for s, p, o in g.triples((None,RDFS.subClassOf,ns.Person)):\n","    print (s)\n","    print (g.value(subject=None,predicate=RDFS.subClassOf,object=s))"],"execution_count":9,"outputs":[{"output_type":"stream","text":["SUBCLASSES\n","http://somewhere#Researcher\n","http://somewhere#PhDstudent\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"s_OOSy3Narze","executionInfo":{"status":"ok","timestamp":1601718015721,"user_tz":-120,"elapsed":2046,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"64a8fa0b-341a-4d50-b743-69a0e73ec78a","colab":{"base_uri":"https://localhost:8080/","height":51}},"source":["#RDFLib + SPARQL\n","from rdflib.plugins.sparql import prepareQuery\n","\n","q1 = prepareQuery ('''\n","  SELECT ?s WHERE { ?s rdfs:subClassOf/rdfs:subClassOf* ns:Person. }\n","''',\n","initNs = { \"ns\": ns})\n","for a in g.query(q1):\n","  print (a.s)"],"execution_count":10,"outputs":[{"output_type":"stream","text":["http://somewhere#Researcher\n","http://somewhere#PhDstudent\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"id":"z_9JnrZPhOBp","executionInfo":{"status":"ok","timestamp":1601718621136,"user_tz":-120,"elapsed":729,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"b9a10f4c-0e1e-46be-f557-609df0252939","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib\n","for s, p, o in g.triples((None,RDF.type,ns.Person)):\n","  print (s)\n","print (g.value(subject=None,predicate=p,object=(g.value(subject=None,predicate=RDFS.subClassOf,object=o))))\n","\n"],"execution_count":22,"outputs":[{"output_type":"stream","text":["http://somewhere#SaraJones\n","http://somewhere#JohnSmith\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"k1vTxqpbfWg1","executionInfo":{"status":"ok","timestamp":1601718142848,"user_tz":-120,"elapsed":2485,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"aa40592c-b6ef-4892-9948-2a56be5ea658","colab":{"base_uri":"https://localhost:8080/","height":68}},"source":["#RDFLib+SPARQL\n","q2=prepareQuery('''\n","  SELECT ?s WHERE {?s a/rdfs:subClassOf* ns:Person.}\n","  ''',\n","  initNs = {\"ns\":ns } )\n","\n","for a in g.query(q2):\n","  print (a.s)"],"execution_count":13,"outputs":[{"output_type":"stream","text":["http://somewhere#SaraJones\n","http://somewhere#JohnSmith\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"id":"kyAfdnhXjJaC","executionInfo":{"status":"ok","timestamp":1601718675849,"user_tz":-120,"elapsed":789,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"23ddf6ac-9d52-4a66-ac66-6f86b42cd954","colab":{"base_uri":"https://localhost:8080/","height":241}},"source":["#RDFLib\n","for s, p, o in g.triples((None,RDF.type,ns.Person)):\n","  for s1,p1,o1 in g.triples((s,None,None)):\n","    print(s1,p1,o1)\n","for s,p,o in g.triples((None,RDF.type,g.value(subject=None,predicate=RDFS.subClassOf,object=ns.Person))):\n","  for s2,p2,o2 in g.triples((s,None,None)):\n","    print(s2,p2,o2)"],"execution_count":23,"outputs":[{"output_type":"stream","text":["http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"WacnGUj2jaO9","executionInfo":{"status":"ok","timestamp":1601636542975,"user_tz":-120,"elapsed":1635,"user":{"displayName":"Blanca Rodrigo Lacave","photoUrl":"","userId":"08589301472596233215"}},"outputId":"ba4fb6d6-e332-4bd1-b828-d671b819e507","colab":{"base_uri":"https://localhost:8080/","height":221}},"source":["#RDFLib + SPARQL\n","q3=prepareQuery('''\n","  SELECT ?s ?p ?o WHERE {?s a/rdfs:subClassOf* ns:Person. \n","                      ?s ?p ?o}\n","  ''',\n","  initNs = { \"ns\": ns} )\n","\n","for a in g.query(q3):\n","  print(a.s, a.p, a.o)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]}]}